telegram_token = '6287798525:AAHGmutQYOHuhJlNsY07byvdSC4TxQwLb64'
#telegram_token = '5972244696:AAFnydqHSJHVWcAMkij1eaE7Jqoe1d-11x0'
admin_ids = [547380383, 365627479, 413512781]
max_title_length = 255
max_items_per_account = 10
max_description_length = 3000
pictures_amount = 2

group_url = 'https://t.me/Russian_excavators'

hello_message = 'Главное меню'

search_message = '🔎 Выберите категорию для поиска:'

select_category = '🔎 Выберите категорию:'

send_title = 'Пришлите название:'

send_description = 'Пришлите описание:'

send_picture = 'Пришлите фото:'

send_picture2 = 'Пришлите ещё одно фото:'

title_too_long = f'Слишком длинное название. Максимальное количество символов: {max_title_length}'

description_too_long = f'Слишком длинное описание. Максимальное количество символов: {max_description_length}'

send_price = 'Пришлите цену:'

invalid_price = 'Цена должна быть целым числом'

item_created = 'Объявление успешно создано'

no_items = 'Не найдено объявлений в этой категории'

get_phone_number = 'Для работы с ботом введите номер телефона:'

after_item = '''▪️ чтобы посмотреть другие товары из категории "category_name" нажмите кнопку ниже

▪️ чтобы выбрать другую категорию вещей, нажмите кнопку "другие категории"'''

main_menu = 'Главное меню  🔙'

get_new_phone_number = 'Введите новый номер телефона:'

yes = 'ДА ✅'

no = 'НЕТ ❌'

back = 'Назад 🔙'

search_item = 'Поиск объявлений  🔍'

create_item = 'Разместить объявления ✍️'

look_my_items = 'Посмотреть свои объявления 👀'

our_group = 'Наше сообщество  💎'

change_phone_number = 'Изменить номер телефона 📞'

remove_item_cancelled = 'Удаление объявления отменено'

item_not_found = 'Объявление не найдено, скорее всего оно было удалено.'

demand = 'Спрос 💸'

other_categories = 'Другие категории  👉'

remove_item = 'Удалить объявление 🌪'

change_price = 'Изменить цену✍️'

get_new_price = 'Пришлите новую цену:'

item_removed_success = 'Объявление удалено'

choose_subcategory = 'Выберите подкатегорию:'

change_item = 'Изменить объявление✍️'

get_new_title = 'Пришлите новое название для объявления'

get_new_description = 'Пришлите ново описание для объявления'

get_new_picture = 'Пришлите новую фотографию'

ban_user = 'Заблокировать пользователя'

banned = 'Вы были заблокированы админстрацией, поэтому не можете размещать объявления.'

unban_message = 'Вы были разблокированы.'

support = 'Тех. поддержка 🛠'

support_url = 'https://t.me/technicalsupport97'

unban_group_url = 'https://t.me/Applicationsforunlocking'

set_phone_number = 'Для создания объявлений вам необходимо указать ваш номер телефона, это можно сделать по кнопке в главном меню.'