telegram_token = '5972244696:AAFnydqHSJHVWcAMkij1eaE7Jqoe1d-11x0'
admin_ids = [547380383]
max_title_length = 255
max_items_per_account = 10
max_description_length = 3000
group_url = 't.me'
hello_message = 'Главное меню'
search_message = '🔎 Выберите категорию для поиска:'
send_title = 'Пришлите название:'
send_description = 'Пришлите описание:'
send_picture = 'Пришлите фото:'
send_picture2 = 'Пришлите ещё одно фото:'
title_too_long = f'Слишком длинное название. Максимальное количество символов: {max_title_length}'
description_too_long = f'Слишком длинное описание. Максимальное количество символов: {max_description_length}'
send_price = 'Пришлите цену:'
invalid_price = 'Цена должна быть целым числом'
item_created = 'Объявление успешно создано'
no_items = 'Не найдено объявлений в этой категории'
get_phone_number = 'Для работы с ботом введите номер телефона:'
after_item = '''▪️ чтобы посмотреть другие товары из категории "category_name" нажмите кнопку ниже

▪️ чтобы выбрать другую категорию вещей, нажмите кнопку "другие категории"'''